1. You have a list which contains country names. you need to sort this list according to the length of elements ascending order

In [3]:
ls = ['Uzbekistan','USA','UK','Germany','Chine']
# expected output: ['UK','USA,'Chine','Germany','Uzbekistan']

In [4]:
ls.sort(key=lambda x:len(x))
ls

['UK', 'USA', 'Chine', 'Germany', 'Uzbekistan']

2. Write a Python program to find the indexes of numbers in a following list below a given threshold.

In [5]:
ls = [0, 12, 45, 3, 4923, 322, 105, 29, 15, 39, 55]
threshold = 100
# expected output: [0, 1, 2, 3, 7, 8, 9, 10]

In [8]:
def myfunction(x):
    result = []
    for i in ls:
        if i < threshold:
            result.append(ls.index(i))
    return result

myfunction(ls)

[0, 1, 2, 3, 7, 8, 9, 10]

3. Write a recursive function to find the sum of the digits of a number.

In [144]:
number = 24555555

def digit_function(x):
    lst = [int(i) for i in str(number)]
    return sum(lst)

digit_function(number)

36

4. Given a list of dictionaries, write a function that combines them into a single dictionary. 
	If a key appears in multiple dictionaries, sum the values.

In [31]:
# Example usage
# print(combine_dictionaries([{'a': 1, 'b': 2}, {'a': 2, 'c': 3}, {'b': 3}]))
# Output: {'a': 3, 'b': 5, 'c': 3}

In [115]:
def combining_dicts(dict_list):
    combined_dict = {}
    
    for d in dict_list:
        for key, value in d.items():
            combined_dict[key] = combined_dict.get(key, 0) + value
    
    return combined_dict

combine_dictionaries = [{'a': 1, 'b': 2}, {'a': 2, 'c': 3}, {'b': 3}] 

combining_dicts(combine_dictionaries)

{'a': 3, 'b': 5, 'c': 3}

5. Using employee_data.csv file.
	task 3. Find Employees Earning Above Their Country’s Average Salary

task 1. Create 4 separate csv files for 4 different countries

In [145]:
import pandas as pd

df = pd.read_csv(r'employee_data.csv')
USA_csv = df[df['Birth_Country'] == 'USA'] 
USA_csv.to_csv('USA_employees')
df.head()

,EmpID,EmpName,BirthDate,HireDate,DepartmentID,Salary,Birth_Country
0,1,Cathy Reeves,1975-12-25,2013-01-08,101,104666.75,USA
1,2,William Ward,1972-01-01,2009-10-23,105,79245.98,Germany
2,3,Kevin Moore,1992-08-26,2022-09-12,105,32528.41,Germany
3,4,Jason Young,1964-08-08,2008-04-01,105,83259.50,India
4,5,Angela Brown,1965-07-18,2005-06-22,103,114796.51,Germany

In [69]:
Germany_csv = df[df['Birth_Country']=='Germany']
Germany_csv.to_csv('Germany_employees')

In [72]:
India_csv = df[df['Birth_Country']=='India']
India_csv.to_csv('India_employees')

In [78]:
UK_csv = df[df['Birth_Country']=='UK']
UK_csv.to_csv('UK_employees')

task 2. Find the Most Experienced Employee in Each Country

In [135]:
hiredate_df = (df
 .groupby('Birth_Country')
 .agg({'HireDate':'min'})).reset_index()

new = df.merge(hiredate_df,how='inner',on='Birth_Country')

# Employees with highest exp
new[new['HireDate_x'] == new['HireDate_y']]['EmpName']

4            Angela Brown
9          Yvonne Webster
29        Joseph Reynolds
31    Elizabeth Alexander
Name: EmpName, dtype: object

task 3. Find Employees Earning Above Their Country’s Average Salary

In [100]:
avg_counry = (df
 .groupby('Birth_Country')
 .agg({'Salary':'mean'})).reset_index()
avg_counry

  Birth_Country        Salary
0       Germany  73905.116667
1         India  70164.840000
2            UK  74150.792500
3           USA  75968.236667

Final result

In [150]:
new_df = df.merge(avg_counry,how='inner',on='Birth_Country')
new_df[new_df['Salary_x'] > new_df['Salary_y']][['EmpID','EmpName','BirthDate','HireDate','DepartmentID','Salary_x','Birth_Country']]

,EmpID,EmpName,BirthDate,HireDate,DepartmentID,Salary_x,Birth_Country
0,1,Cathy Reeves,1975-12-25,2013-01-08,101,104666.75,USA
1,2,William Ward,1972-01-01,2009-10-23,105,79245.98,Germany
3,4,Jason Young,1964-08-08,2008-04-01,105,83259.50,India
4,5,Angela Brown,1965-07-18,2005-06-22,103,114796.51,Germany
5,6,Lisa Brown DVM,1972-09-24,2020-07-26,104,88253.26,Germany
8,9,Christopher Nguyen,2001-08-03,2017-09-17,103,75448.89,India
10,11,Sandra Beck,1998-07-03,2022-06-16,103,111337.15,USA
11,12,Donald Snow,1999-03-10,2008-01-20,102,105739.53,UK
14,15,Deborah Cortez,1993-12-15,2019-03-04,105,100070.64,India
15,16,John Craig,2000-01-15,2017-12-18,104,90916.00,Germany
16,17,Sheri Walker,1981-12-28,2023-12-08,104,75808.56,India
19,20,Morgan Boyle,1988-10-22,2015-08-26,102,78062.83,Germany
20,21,Richard Rice,1964-04-11,2024-09-15,104,92851.77,UK
21,22,Gregory Rodriguez,1966-10-11,2023-12-24,102,77922.92,India
26,27,Eric Atkins,1982-06-05,2010-06-29,102,75420.44,Germany
29,30,Joseph Reynolds,1989-09-28,2005-09-24,102,80431.53,UK
30,31,Jessica Palmer,1996-10-29,2010-01-06,103,117050.58,UK
38,39,Christine Williams,1994-10-19,2020-01-02,105,112393.55,USA
39,40,Kelly Love,1998-04-23,2010-09-05,104,75365.39,UK
41,42,Thomas Holmes,1975-06-16,2010-03-17,101,101953.27,India
43,44,Hannah Williamson,1986-04-16,2017-05-06,103,98521.71,India
44,45,Kristy Norton,1978-06-13,2019-07-09,102,109640.55,UK
45,46,Jessica Brown,1984-09-11,2007-01-21,101,101468.12,Germany
46,47,Deanna Mitchell,1970-04-28,2012-10-19,101,92689.06,India
47,48,Christine Jensen,1964-10-25,2008-10-19,105,102135.87,Germany
48,49,Jacob Jimenez,1994-11-24,2023-11-25,102,77628.89,USA